/* automatically generated by rust-bindgen 0.57.0 */

pub const REDISMODULE_OK: isize = 0;
pub const REDISMODULE_ERR: isize = 1;
pub const REDISMODULE_APIVER_1: u32 = 1;
pub const REDISMODULE_READ: u32 = 1;
pub const REDISMODULE_WRITE: u32 = 2;
pub const REDISMODULE_OPEN_KEY_NOTOUCH: u32 = 65536;
pub const REDISMODULE_LIST_HEAD: u32 = 0;
pub const REDISMODULE_LIST_TAIL: u32 = 1;
pub const REDISMODULE_KEYTYPE_EMPTY: isize = 0;
pub const REDISMODULE_KEYTYPE_STRING: isize = 1;
pub const REDISMODULE_KEYTYPE_LIST: isize = 2;
pub const REDISMODULE_KEYTYPE_HASH: isize = 3;
pub const REDISMODULE_KEYTYPE_SET: isize = 4;
pub const REDISMODULE_KEYTYPE_ZSET: isize = 5;
pub const REDISMODULE_KEYTYPE_MODULE: isize = 6;
pub const REDISMODULE_KEYTYPE_STREAM: isize = 7;
pub const REDISMODULE_REPLY_UNKNOWN: isize = -1;
pub const REDISMODULE_REPLY_STRING: isize = 0;
pub const REDISMODULE_REPLY_ERROR: isize = 1;
pub const REDISMODULE_REPLY_INTEGER: isize = 2;
pub const REDISMODULE_REPLY_ARRAY: isize = 3;
pub const REDISMODULE_REPLY_NULL: isize = 4;
pub const REDISMODULE_POSTPONED_ARRAY_LEN: i32 = -1;
pub const REDISMODULE_NO_EXPIRE: i32 = -1;
pub const REDISMODULE_ZADD_XX: u32 = 1;
pub const REDISMODULE_ZADD_NX: u32 = 2;
pub const REDISMODULE_ZADD_ADDED: u32 = 4;
pub const REDISMODULE_ZADD_UPDATED: u32 = 8;
pub const REDISMODULE_ZADD_NOP: u32 = 16;
pub const REDISMODULE_HASH_NONE: u32 = 0;
pub const REDISMODULE_HASH_NX: u32 = 1;
pub const REDISMODULE_HASH_XX: u32 = 2;

pub const REDISMODULE_EVENT_REPLICATION_ROLE_CHANGED: u64 = 0;
pub const REDISMODULE_EVENT_PERSISTENCE: u64 = 1;
pub const REDISMODULE_EVENT_FLUSHDB: u64 = 2;
pub const REDISMODULE_EVENT_LOADING: u64 = 3;
pub const REDISMODULE_EVENT_CLIENT_CHANGE: u64 = 4;
pub const REDISMODULE_EVENT_SHUTDOWN: u64 = 5;
pub const REDISMODULE_EVENT_REPLICA_CHANGE: u64 = 6;
pub const REDISMODULE_EVENT_MASTER_LINK_CHANGE: u64 = 7;
pub const REDISMODULE_EVENT_CRON_LOOP: u64 = 8;
pub const REDISMODULE_EVENT_MODULE_CHANGE: u64 = 9;
pub const REDISMODULE_EVENT_LOADING_PROGRESS: u64 = 10;
pub const REDISMODULE_SUBEVENT_PERSISTENCE_RDB_START: u64 = 0;
pub const REDISMODULE_SUBEVENT_PERSISTENCE_AOF_START: u64 = 1;
pub const REDISMODULE_SUBEVENT_PERSISTENCE_SYNC_RDB_START: u64 = 2;
pub const REDISMODULE_SUBEVENT_PERSISTENCE_ENDED: u64 = 3;
pub const REDISMODULE_SUBEVENT_PERSISTENCE_FAILED: u64 = 4;
pub const REDISMODULE_SUBEVENT_LOADING_RDB_START: u64 = 0;
pub const REDISMODULE_SUBEVENT_LOADING_AOF_START: u64 = 1;
pub const REDISMODULE_SUBEVENT_LOADING_REPL_START: u64 = 2;
pub const REDISMODULE_SUBEVENT_LOADING_ENDED: u64 = 3;
pub const REDISMODULE_SUBEVENT_LOADING_FAILED: u64 = 4;
pub const REDISMODULE_SUBEVENT_CLIENT_CHANGE_CONNECTED: u64 = 0;
pub const REDISMODULE_SUBEVENT_CLIENT_CHANGE_DISCONNECTED: u64 = 1;
pub const REDISMODULE_SUBEVENT_MASTER_LINK_UP: u64 = 0;
pub const REDISMODULE_SUBEVENT_MASTER_LINK_DOWN: u64 = 1;
pub const REDISMODULE_SUBEVENT_REPLICA_CHANGE_ONLINE: u64 = 0;
pub const REDISMODULE_SUBEVENT_REPLICA_CHANGE_OFFLINE: u64 = 1;
pub const REDISMODULE_EVENT_REPLROLECHANGED_NOW_MASTER: u64 = 0;
pub const REDISMODULE_EVENT_REPLROLECHANGED_NOW_REPLICA: u64 = 1;
pub const REDISMODULE_SUBEVENT_FLUSHDB_START: u64 = 0;
pub const REDISMODULE_SUBEVENT_FLUSHDB_END: u64 = 1;
pub const REDISMODULE_SUBEVENT_MODULE_LOADED: u64 = 0;
pub const REDISMODULE_SUBEVENT_MODULE_UNLOADED: u64 = 1;
pub const REDISMODULE_SUBEVENT_LOADING_PROGRESS_RDB: u64 = 0;
pub const REDISMODULE_SUBEVENT_LOADING_PROGRESS_AOF: u64 = 1;
pub const REDISMODULE_CLIENTINFO_FLAG_SSL: u32 = 1;
pub const REDISMODULE_CLIENTINFO_FLAG_PUBSUB: u32 = 2;
pub const REDISMODULE_CLIENTINFO_FLAG_BLOCKED: u32 = 4;
pub const REDISMODULE_CLIENTINFO_FLAG_TRACKING: u32 = 8;
pub const REDISMODULE_CLIENTINFO_FLAG_UNIXSOCKET: u32 = 16;
pub const REDISMODULE_CLIENTINFO_FLAG_MULTI: u32 = 32;
pub const REDISMODULE_CLIENTINFO_VERSION: u32 = 1;
pub const REDISMODULE_REPLICATIONINFO_VERSION: u32 = 1;
pub const REDISMODULE_FLUSHINFO_VERSION: u32 = 1;
pub const REDISMODULE_MODULE_CHANGE_VERSION: u32 = 1;
pub const REDISMODULE_CRON_LOOP_VERSION: u32 = 1;
pub const REDISMODULE_LOADING_PROGRESS_VERSION: u32 = 1;
pub const REDISMODULE_TYPE_METHOD_VERSION: u32 = 2;
pub type RedisModuleTimerID = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleEvent {
    pub id: u64,
    pub dataver: u64,
}
#[test]
fn bindgen_test_layout_RedisModuleEvent() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleEvent>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleEvent>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleEvent),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleEvent>())).dataver as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleEvent),
            "::",
            stringify!(dataver)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCtx {
    _unused: [u8; 0],
}
pub type RedisModuleEventCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        eid: RedisModuleEvent,
        subevent: u64,
        data: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub static RedisModuleEvent_ReplicationRoleChanged: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Persistence: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_FlushDB: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Loading: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ClientChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_Shutdown: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ReplicaChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_CronLoop: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_MasterLinkChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_ModuleChange: RedisModuleEvent;
}
extern "C" {
    pub static RedisModuleEvent_LoadingProgress: RedisModuleEvent;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RedisModuleClientInfo {
    pub version: u64,
    pub flags: u64,
    pub id: u64,
    pub addr: [::std::os::raw::c_char; 46usize],
    pub port: u16,
    pub db: u16,
}
#[test]
fn bindgen_test_layout_RedisModuleClientInfo() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleClientInfo>(),
        80usize,
        concat!("Size of: ", stringify!(RedisModuleClientInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleClientInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleClientInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleClientInfo>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleClientInfo>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleClientInfo>())).id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleClientInfo>())).addr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleClientInfo>())).port as *const _ as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleClientInfo>())).db as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleClientInfo),
            "::",
            stringify!(db)
        )
    );
}
pub type RedisModuleClientInfoV1 = RedisModuleClientInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleReplicationInfo {
    pub version: u64,
    pub master: ::std::os::raw::c_int,
    pub masterhost: *mut ::std::os::raw::c_char,
    pub masterport: ::std::os::raw::c_int,
    pub replid1: *mut ::std::os::raw::c_char,
    pub replid2: *mut ::std::os::raw::c_char,
    pub repl1_offset: u64,
    pub repl2_offset: u64,
}
#[test]
fn bindgen_test_layout_RedisModuleReplicationInfo() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleReplicationInfo>(),
        64usize,
        concat!("Size of: ", stringify!(RedisModuleReplicationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleReplicationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleReplicationInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).master as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).masterhost as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(masterhost)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).masterport as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(masterport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).replid1 as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(replid1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).replid2 as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(replid2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).repl1_offset as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(repl1_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleReplicationInfo>())).repl2_offset as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleReplicationInfo),
            "::",
            stringify!(repl2_offset)
        )
    );
}
pub type RedisModuleReplicationInfoV1 = RedisModuleReplicationInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleFlushInfo {
    pub version: u64,
    pub sync: i32,
    pub dbnum: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleFlushInfo() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleFlushInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleFlushInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleFlushInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleFlushInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleFlushInfo>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleFlushInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleFlushInfo>())).sync as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleFlushInfo),
            "::",
            stringify!(sync)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleFlushInfo>())).dbnum as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleFlushInfo),
            "::",
            stringify!(dbnum)
        )
    );
}
pub type RedisModuleFlushInfoV1 = RedisModuleFlushInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleModuleChange {
    pub version: u64,
    pub module_name: *const ::std::os::raw::c_char,
    pub module_version: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleModuleChange() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleModuleChange>(),
        24usize,
        concat!("Size of: ", stringify!(RedisModuleModuleChange))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleModuleChange>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleModuleChange))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleModuleChange>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleModuleChange),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleModuleChange>())).module_name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleModuleChange),
            "::",
            stringify!(module_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleModuleChange>())).module_version as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleModuleChange),
            "::",
            stringify!(module_version)
        )
    );
}
pub type RedisModuleModuleChangeV1 = RedisModuleModuleChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCronLoopInfo {
    pub version: u64,
    pub hz: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleCronLoopInfo() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleCronLoopInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleCronLoopInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleCronLoopInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleCronLoopInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleCronLoopInfo>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCronLoopInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleCronLoopInfo>())).hz as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleCronLoopInfo),
            "::",
            stringify!(hz)
        )
    );
}
pub type RedisModuleCronLoopV1 = RedisModuleCronLoopInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleLoadingProgressInfo {
    pub version: u64,
    pub hz: i32,
    pub progress: i32,
}
#[test]
fn bindgen_test_layout_RedisModuleLoadingProgressInfo() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleLoadingProgressInfo>(),
        16usize,
        concat!("Size of: ", stringify!(RedisModuleLoadingProgressInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleLoadingProgressInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleLoadingProgressInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleLoadingProgressInfo>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleLoadingProgressInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleLoadingProgressInfo>())).hz as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleLoadingProgressInfo),
            "::",
            stringify!(hz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleLoadingProgressInfo>())).progress as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleLoadingProgressInfo),
            "::",
            stringify!(progress)
        )
    );
}
pub type RedisModuleLoadingProgressV1 = RedisModuleLoadingProgressInfo;
pub type mstime_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKey {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleString {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCallReply {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleIO {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDigest {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleBlockedClient {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleClusterInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDict {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDictIter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandFilterCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandFilter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleInfoCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleServerInfoData {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleScanCursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleUser {
    _unused: [u8; 0],
}
pub type RedisModuleCmdFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        argv: *mut *mut RedisModuleString,
        argc: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleDisconnectFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, bc: *mut RedisModuleBlockedClient),
>;
pub type RedisModuleNotificationFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        type_: ::std::os::raw::c_int,
        event: *const ::std::os::raw::c_char,
        key: *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleTypeLoadFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        encver: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModuleTypeSaveFunc = ::std::option::Option<
    unsafe extern "C" fn(rdb: *mut RedisModuleIO, value: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeAuxLoadFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        encver: ::std::os::raw::c_int,
        when: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleTypeAuxSaveFunc = ::std::option::Option<
    unsafe extern "C" fn(rdb: *mut RedisModuleIO, when: ::std::os::raw::c_int),
>;
pub type RedisModuleTypeRewriteFunc = ::std::option::Option<
    unsafe extern "C" fn(
        aof: *mut RedisModuleIO,
        key: *mut RedisModuleString,
        value: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleTypeMemUsageFunc =
    ::std::option::Option<unsafe extern "C" fn(value: *const ::std::os::raw::c_void) -> usize>;
pub type RedisModuleTypeDigestFunc = ::std::option::Option<
    unsafe extern "C" fn(digest: *mut RedisModuleDigest, value: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeFreeFunc =
    ::std::option::Option<unsafe extern "C" fn(value: *mut ::std::os::raw::c_void)>;
pub type RedisModuleClusterMessageReceiver = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        sender_id: *const ::std::os::raw::c_char,
        type_: u8,
        payload: *const ::std::os::raw::c_uchar,
        len: u32,
    ),
>;
pub type RedisModuleTimerProc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, data: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleCommandFilterFunc =
    ::std::option::Option<unsafe extern "C" fn(filter: *mut RedisModuleCommandFilterCtx)>;
pub type RedisModuleForkDoneHandler = ::std::option::Option<
    unsafe extern "C" fn(
        exitcode: ::std::os::raw::c_int,
        bysignal: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleInfoFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleInfoCtx, for_crash_report: ::std::os::raw::c_int),
>;
pub type RedisModuleScanCB = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        keyname: *mut RedisModuleString,
        key: *mut RedisModuleKey,
        privdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleScanKeyCB = ::std::option::Option<
    unsafe extern "C" fn(
        key: *mut RedisModuleKey,
        field: *mut RedisModuleString,
        value: *mut RedisModuleString,
        privdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleUserChangedFunc = ::std::option::Option<
    unsafe extern "C" fn(client_id: u64, privdata: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleTypeMethods {
    pub version: u64,
    pub rdb_load: RedisModuleTypeLoadFunc,
    pub rdb_save: RedisModuleTypeSaveFunc,
    pub aof_rewrite: RedisModuleTypeRewriteFunc,
    pub mem_usage: RedisModuleTypeMemUsageFunc,
    pub digest: RedisModuleTypeDigestFunc,
    pub free: RedisModuleTypeFreeFunc,
    pub aux_load: RedisModuleTypeAuxLoadFunc,
    pub aux_save: RedisModuleTypeAuxSaveFunc,
    pub aux_save_triggers: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RedisModuleTypeMethods() {
    assert_eq!(
        ::std::mem::size_of::<RedisModuleTypeMethods>(),
        80usize,
        concat!("Size of: ", stringify!(RedisModuleTypeMethods))
    );
    assert_eq!(
        ::std::mem::align_of::<RedisModuleTypeMethods>(),
        8usize,
        concat!("Alignment of ", stringify!(RedisModuleTypeMethods))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleTypeMethods>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleTypeMethods>())).rdb_load as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(rdb_load)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleTypeMethods>())).rdb_save as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(rdb_save)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleTypeMethods>())).aof_rewrite as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aof_rewrite)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleTypeMethods>())).mem_usage as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(mem_usage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleTypeMethods>())).digest as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(digest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleTypeMethods>())).free as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleTypeMethods>())).aux_load as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aux_load)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RedisModuleTypeMethods>())).aux_save as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aux_save)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RedisModuleTypeMethods>())).aux_save_triggers as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RedisModuleTypeMethods),
            "::",
            stringify!(aux_save_triggers)
        )
    );
}
extern "C" {
    pub static mut RedisModule_Alloc:
        ::std::option::Option<unsafe extern "C" fn(bytes: usize) -> *mut ::std::os::raw::c_void>;
}
extern "C" {
    pub static mut RedisModule_Realloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            bytes: usize,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
extern "C" {
    pub static mut RedisModule_Free:
        ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>;
}
extern "C" {
    pub static mut RedisModule_Calloc: ::std::option::Option<
        unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void,
    >;
}
extern "C" {
    pub static mut RedisModule_Strdup: ::std::option::Option<
